package cl.salazarfelipe.japanesetrainer.data

var listHiraganaChar = mutableListOf(
        // vocales
        "あ", "い", "う", "え", "お",
        // K - G
        "か", "き", "く", "け", "こ",
        "が", "ぎ", "ぐ", "げ", "ご",
        // S - Z
        "さ","し","す","せ","そ",
        "ざ","じ","ず","ぜ","ぞ",
        // T - D
        "た","ち","つ","て","と",
        "だ","ぢ","づ","で","ど",
        // N
        "な","に","ぬ","ね","の",
        // H - B - P
        "は","ひ","ふ","へ","ほ",
        "ば","び","ぶ","べ","ぼ",
        "ぱ","ぴ","ぷ","ぺ","ぽ",
        // M
        "ま","み","む","め","も",
        // YA - YU - YO
        "や","ゆ","よ",
        // R
        "ら","り","る","れ","ろ",
        // WA - WO - N
        "わ","を","ん",
        // KY - GY (A-U-O)
        "きゃ","きゅ","きょ",
        "ぎゃ","ぎゅ","ぎょ",
        // SH - J
        "しゃ","しゅ","しょ",
        "じゃ","じゅ","じょ",
        // CH - DJ
        "ちゃ","ちゅ","ちょ",
        "ぢゃ","ぢゅ","ぢょ",
        // NY
        "にゃ","にゅ","にょ",
        // HY - BY - PY
        "ひゃ","ひゅ","ひょ",
        "びゃ","びゅ","びょ",
        "ぴゃ","ぴゅ","ぴょ",
        // MY
        "みゃ","みゅ","みょ",
        // RY
        "りゃ","りゅ","りょ"
)

