package cl.salazarfelipe.japanesetrainer.data

var listHiraganaChar = mutableListOf(
        // vocales
        "あ", "い", "う", "え", "お",
        // K - G
        "か", "き", "く", "け", "こ",
        "が", "ぎ", "ぐ", "げ", "ご",
        // S - Z
        "さ","し","す","せ","そ",
        "ざ","じ","ず","ぜ","ぞ",
        // T - D
        "た","ち","つ","て","と",
        "だ","ぢ","づ","で","ど",
        // N
        "な","に","ぬ","ね","の",
        // H - B - P
        "は","ひ","ふ","へ","ほ",
        "ば","び","ぶ","べ","ぼ",
        "ぱ","ぴ","ぷ","ぺ","ぽ",
        // M
        "ま","み","む","め","も",
        // YA - YU - YO
        "や","ゆ","よ",
        // R
        "ら","り","る","れ","ろ",
        // WA - WO - N
        "わ","を","ん",
        // KY - GY (A-U-O)
        "きゃ","きゅ","きょ",
        "ぎゃ","ぎゅ","ぎょ",
        // SH - J
        "しゃ","しゅ","しょ",
        "じゃ","じゅ","じょ",
        // CH - DJ
        "ちゃ","ちゅ","ちょ",
        "ぢゃ","ぢゅ","ぢょ",
        // NY
        "にゃ","にゅ","にょ",
        // HY - BY - PY
        "ひゃ","ひゅ","ひょ",
        "びゃ","びゅ","びょ",
        "ぴゃ","ぴゅ","ぴょ",
        // MY
        "みゃ","みゅ","みょ",
        // RY
        "りゃ","りゅ","りょ"
)

var listKatakanaChar = mutableListOf(
        // vocales
        "ア", "イ", "ウ", "エ", "オ",
        // K - G
        "カ", "キ", "ク", "ケ", "コ",
        "ガ", "ギ", "グ", "ゲ", "ゴ",
        // S - Z
        "サ","シ","ス","セ","ソ",
        "ザ","ジ","ズ","ゼ","ゾ",
        // T - D
        "タ","チ","ツ","テ","ト",
        "ダ","ヂ","ヅ","デ","ド",
        // N
        "ナ","ニ","ヌ","ネ","ノ",
        // H - B - P
        "ハ","ヒ","フ","ヘ","ホ",
        "バ","ビ","ブ","ベ","ボ",
        "パ","ピ","プ","ペ","ポ",
        // M
        "マ","ミ","ム","メ","モ",
        // YA - YU - YO
        "ヤ","ユ","ヨ",
        // R
        "ラ","リ","ル","レ","ロ",
        // WA - WO - N
        "ワ","ヲ","ン",
        // Y
        "ャ", "ュ", "ョ",
        // KY - GY (A-U-O)
        "キャ","キュ","キョ",
        "ギャ","ギュ","ギョ",
        // SH - J
        "シャ","シュ","ショ",
        "ジャ","ジュ","ジョ",
        // CH - DJ
        "チャ","チュ","チョ",
        "ヂャ","ヂュ","ヂョ",
        // NY
        "ニャ","ニュ","ニョ",
        // HY - BY - PY
        "ヒャ","ヒュ","ヒョ",
        "ビャ","ビュ","ビョ",
        "ピャ","ピュ","ピョ",
        // MY
        "ミャ","ミュ","ミョ",
        // RY
        "リャ","リュ","リョ"
)